CSI API ETABS v1
cDatabaseTables.SetLoadPatternsSelectedForDisplay Method
 Sets the load patterns that are selected for table display.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetLoadPatternsSelectedForDisplay(
	ref string[] LoadPatternList
)
Function SetLoadPatternsSelectedForDisplay (
	ByRef LoadPatternList As String()
) As Integer
Dim instance As cDatabaseTables
Dim LoadPatternList As String()
Dim returnValue As Integer
returnValue = instance.SetLoadPatternsSelectedForDisplay(LoadPatternList)
int SetLoadPatternsSelectedForDisplay(
	array<String^>^% LoadPatternList
)
abstract SetLoadPatternsSelectedForDisplay :
        LoadPatternList : string[] byref -> int
Parameters
LoadPatternList
Type: System.String[]
Input Item: The zero-based list of load patterns selected for table display.
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
Remarks
 This list sets the load patterns that are included when displaying load assignments on the model. If no load patterns are to be selected then the LoadPatternList item should include a single blank string.
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace